; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	thermograph0 - mode
	image1 - mode
	Star0 - direction
	Star5 - direction
	GroundStation4 - direction
	Star7 - direction
	Star10 - direction
	GroundStation3 - direction
	GroundStation8 - direction
	Star9 - direction
	Star6 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star5)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star10)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 Star7)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 Star9)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star9)
	(supports instrument5 image1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 Star9)
	(supports instrument6 thermograph0)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star10)
)
(:goal (and
	(pointing satellite1 GroundStation2)
	(pointing satellite4 Star12)
	(have_image Planet11 image1)
	(have_image Star12 thermograph0)
	(have_image Star13 image1)
	(have_image Planet14 thermograph0)
	(have_image Star15 image1)
	(have_image Phenomenon16 thermograph0)
))

)

; plan
1. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 0 of 8
2. (calibrate satellite3 instrument4 star9)
   added: (calibrated instrument4)
   goals met: 0 of 8
3. (turn_to satellite3 planet14 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 planet14)
   goals met: 0 of 8
4. (take_image satellite3 planet14 instrument4 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 1 of 8
5. (turn_to satellite3 planet11 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet11)
   goals met: 1 of 8
6. (take_image satellite3 planet11 instrument4 image1)
   added: (have_image planet11 image1)
   goals met: 2 of 8
7. (turn_to satellite3 phenomenon16 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 phenomenon16)
   goals met: 2 of 8
8. (turn_to satellite1 groundstation2 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 groundstation2)
   goals met: 3 of 8
9. (take_image satellite3 phenomenon16 instrument4 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 4 of 8
10. (turn_to satellite3 star12 phenomenon16)
   deleted: (pointing satellite3 phenomenon16)
   added: (pointing satellite3 star12)
   goals met: 4 of 8
11. (take_image satellite3 star12 instrument4 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 5 of 8
12. (turn_to satellite3 star13 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 star13)
   goals met: 5 of 8
13. (take_image satellite3 star13 instrument4 image1)
   added: (have_image star13 image1)
   goals met: 6 of 8
14. (turn_to satellite3 star15 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 star15)
   goals met: 6 of 8
15. (take_image satellite3 star15 instrument4 image1)
   added: (have_image star15 image1)
   goals met: 7 of 8
16. (turn_to satellite4 star12 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star12)
   goals met: 8 of 8
